[
  {
    "id": 1,
    "title": "Anne of the Black Hair",
    "subtitle": "Mobile Running Game",
    "where": "2021 Summer Project at KING",
    "thumbnail": "/img/projects/AnneoftheBlackHair.jpg",
    "techStack": ["Unity", "C#", "Aesprite"],
    "myRole": ["Project Manager", "Script Writer", "Character Designer"],
    "startDate": "2021-05",
    "endDate": "2021-09",
    "summary": "Did you know that Anne was actually black haired? Maybe you did, but no one in the village should.",
    "link": "https://github.com/Gamddalki/Anne-of-BlackHair",
    "content": [
      {
        "type": "image",
        "value": "/img/projects/AnneoftheBlackHair2.png"
      },
      {
        "type": "text",
        "value": "In this running game, no one in the village should know that she is black haired. Change your route to avoid the villagers' eyes and safely deliver the fruit as Marilla asked. Be especially careful not to be seen by children — they spread rumors the fastest! If you lose all the fruit or the news of Anne’s black hair spreads throughout the village, the game is over."
      }
    ]
  },
  {
    "id": 2,
    "title": "reICEcle",
    "subtitle": "Point-Based Ice Pack Recycling Application",
    "where": "2021 Software Engineering and Creative Design Project",
    "thumbnail": "/img/projects/reICEcle.svg",
    "techStack": [
      "Mobile Application",
      "Prototyping",
      "Software Design",
      "UML"
    ],
    "myRole": ["Team Lead", "System Analyst & Designer", "UX/UI Designer"],
    "category": ["Mobile Application", "Prototyping", "Software Design", "UML"],
    "credits": ["Sunyu Pang", "Jiyeon Kim", "Yongyeon Kim"],
    "tools": ["Visual Paradigm", "Proto.io"],
    "startDate": "2021-03",
    "endDate": "2021-06",
    "summary": "Prototype of a Mobile Application  \n that aims to **collect ice packs from households**  \n and **rewards users with points**.  \n These points can be used at local businesses,  \n helping to **boost sales that have declined   \n due to COVID-19**.",
    "link": "https://gamddalki.tistory.com/7",
    "content": [
      {
        "type": "text",
        "value": "Development of 'reICEcle' began by brainstorming recent problems and narrowing them down to four key issues. After defining solutions for each, we analyzed their feasibility, demand, and relevance, selecting the final topic. We then conducted a thorough investigation using the '5 Whys method' to define the true problem, followed by in-depth research into the severity of the issue, current solutions, and similar case studies. After collecting data, we grouped similar ideas and clearly defined the core features of the 'Point-based Ice Pack Recycling Service System.'"
      },
      {
        "type": "image",
        "value": "/img/projects/reICEcle1.png"
      },
      {
        "type": "text",
        "value": "In the detailed design phase of the project, we specifically defined the user environment and development environment, created service usage scenarios, and developed use case diagrams and use case lists to form an overview of the system. Based on this, we then created detailed scenarios for each use case and drew sequence diagrams."
      },
      {
        "type": "image",
        "value": "/img/projects/reICEcle2.png"
      },
      {
        "type": "text",
        "value": "Next, we refined the detailed features by creating functional structure diagram, feature list, and mapping the functions to the screens."
      },
      {
        "type": "image",
        "value": "/img/projects/reICEcle3.png"
      },
      {
        "type": "text",
        "value": "We then designed the screen layouts and transition flow diagrams, followed by protocol design, and ultimately developed the final prototype."
      }
    ],
    "selected": true
  },
  {
    "id": 3,
    "title": "Sun the Light",
    "subtitle": "Classic PC Shooting Game",
    "where": "3rd MaKINGJam first-place winning work",
    "thumbnail": "/img/projects/SunTheLight3.gif",
    "techStack": ["Unity", "C#", "Aesprite"],
    "myRole": [
      "Project Manager",
      "Script Writer",
      "Developer",
      "Composer",
      "Map Designer",
      "Logo Designer"
    ],
    "startDate": "2022-11",
    "endDate": "2023-01",
    "summary": "Helios, the God of the Sun has lost his Sun one day. Let’s go find out what happened to his Sun, with the Golden Chariot.",
    "link": "https://github.com/22MaKINGJam/Sun-the-Light",
    "content": [
      {
        "type": "image",
        "value": "/img/projects/SunTheLight.jpg"
      },
      {
        "type": "text",
        "value": "This classic PC shooting game captures the mythological journey of Helios and the tension surrounding his struggle to maintain control over the Sun, blending ancient myth with an action-packed adventure."
      },
      {
        "type": "image",
        "value": "/img/projects/SunTheLight1.gif"
      },
      {
        "type": "text",
        "value": "Helios, the First God of the Sun, rises from the eastern palace and sinks into the land of the Hesperides in the west each day. However, the Sun mysteriously vanishes one day, while he was dozing off for a while. So, unfortunately, Helios must embark on a quest to recover it, risking his fame and his fragile position in Olympus. This scenario is given through the animation at the beginning of the game."
      },
      {
        "type": "image",
        "value": "/img/projects/SunTheLight2.gif"
      },
      {
        "type": "text",
        "value": "The player controls the golden chariot, avoiding or attacking light winds, strong winds, and dark clouds. Bumping onto the winds and clouds causes immediate damage, while successfully attacking them results in points. Additionally, if the chariot is driven too low, villages will burn, and if driven too high, the screams of constellations will be heard. In both cases, the player will take damage. The player can use a skill that shoots fire in all directions at regular intervals."
      },
      {
        "type": "image",
        "value": "/img/projects/SunTheLight3.gif"
      },
      {
        "type": "text",
        "value": "At level 3, Helios gets to meet the Boss mob, Dionysos. Or maybe... another one later on. Guess who's coming next with the thunder light striking out after a danger sign."
      },
      {
        "type": "image",
        "value": "/img/projects/SunTheLight4.gif"
      },
      {
        "type": "text",
        "value": "Player gets to find out what happened to Helios, Dyonisos, and Zeus with Game Over / Clear Animation."
      }
    ],
    "selected": true
  },
  {
    "id": 4,
    "title": "Canticum Choir",
    "subtitle": "Webpage",
    "where": "Freelance Web Development Project",
    "thumbnail": "/img/projects/Canticum.svg",
    "techStack": ["TypeScript", "React", "Node.js", "MySQL"],
    "myRole": ["Developer", "UX/UI Designer"],
    "startDate": "2023-02",
    "endDate": "2024-07",
    "summary": "Designed UX/UI and Developed the whole webpage of Canticum Choir – A choir that heals the soul with inspirational music from medieval mass music to oratorio and contemporary church music.",
    "link": "http://canticum.co.kr/",
    "content": [
      {
        "type": "image",
        "value": "/img/projects/Canticum1.png"
      },
      {
        "type": "text",
        "value": "Designed UX/UI and developed the whole webpage including the Admin page where the choir manager can change wallpaper and upload concert information, newsletters, and notices."
      }
    ]
  },
  {
    "id": 5,
    "title": "ETOE Solutions Co., Ltd.",
    "subtitle": "Webpage",
    "where": "Freelance Web Development Project",
    "thumbnail": "/img/projects/EtoE.svg",
    "techStack": ["pug", "SCSS", "Node.js"],
    "myRole": ["Developer", "UX/UI Designer"],
    "startDate": "2022-02",
    "endDate": "2022-08",
    "summary": "Designed UX/UI and Developed the whole webpage of ETOE Solutions Co., Ltd. – An Oracle DMP (Directly Managed Partner) Company.",
    "link": "http://www.etoe.co.kr/",
    "content": [
      {
        "type": "image",
        "value": "/img/projects/EtoE1.png"
      },
      {
        "type": "text",
        "value": "Designed UX/UI and developed the whole webpage."
      }
    ]
  },
  {
    "id": 6,
    "title": "HalmaeYakson",
    "subtitle": "Household Medicine Delivery Service Application",
    "where": "EWHA Abeek Design-Thinking Prototype Development Education Award-winning work",
    "thumbnail": "/img/projects/HalmaeYakson.png",
    "techStack": [
      "Design Thinking",
      "Software Design",
      "Prototyping",
      "Wireframing"
    ],
    "myRole": ["Project Manager", "UX/UI Designer"],
    "startDate": "2021-08",
    "endDate": "2021-08",
    "summary": "Prototype of s Delivery Service Application for Household Medicines and Other Supplies.",
    "link": "https://gamddalki.tistory.com/4",
    "content": [
      {
        "type": "image",
        "value": "/img/projects/HalmaeYakson1.png"
      },
      {
        "type": "text",
        "value": "'HalmaeYakson' is an award-winning application aimed at addressing a critical issue for single-person households. Our design process began by defining our primary user persona, Se-eun Lee, and identifying the challenges she faced. We focused on safely delivering medicines and other medical supplies to individuals living alone, particularly women, who need assistance when they are unwell. To provide a solution, we developed an application named 'HalmaeYakson (Grandma's Healing Hands)', inspired by the traditional Korean children's song, 'Grandma's Hands are Healing Hands.' Following the ideation stage, we proceeded with screen design and prototype development, ultimately presenting our completed concept. Our work was recognized for its innovation and user-centered approach."
      }
    ]
  },
  {
    "id": 7,
    "title": "Eat:WHA",
    "subtitle": "Ewha Campus Restaurant Guide Web Application",
    "where": "2022 Open SW Platform Project",
    "thumbnail": "/img/projects/EatWHA.gif",
    "techStack": ["HTML", "CSS", "JS", "Python", "Python Flask", "Firebase"],
    "myRole": ["Backend Developer", "UX/UI Designer"],
    "startDate": "2022-09",
    "endDate": "2022-12",
    "summary": "Eat:WHA, the future we crEATe! – A Web Application for Busy Ewha Students to Find the Best Restaurants around campus.",
    "link": "https://github.com/Gamddalki/EatWHA",
    "content": [
      {
        "type": "image",
        "value": "/img/projects/EatWHA1.png"
      },
      {
        "type": "text",
        "value": "Eat:WHA is an intuitive web application that allows users to check a list of restaurants around Ewha Campus based on location, using a cute map feature."
      },
      {
        "type": "text",
        "value": "I was responsible for the UI design and backend development of the whole web page, which includes features such as sign-up, login, logout, and account deletion, as well as restaurant search, menu browsing, themed lists, liking functionality, vegan badges, writing and viewing reviews."
      }
    ]
  },
  {
    "id": 8,
    "title": "Vivid Nightmare",
    "subtitle": "VR escape game",
    "where": "2023 EPITA Summer Program Project",
    "thumbnail": "/img/projects/VividNightmare.png",
    "techStack": ["Unity", "C#", "Oculus Quest 2"],
    "myRole": ["Script Writer", "Designer", "Developer"],
    "startDate": "2023-07",
    "endDate": "2023-07",
    "summary": "You are in a nightmare! Avoid obstacles and find a right key within the given time. Pick up the key and press A at the door to escape from your dream. Otherwise, you'll never get out of the White Christmas's nightmare forever. Check the remaining time on your left wrist, and Good Luck!",
    "link": "https://github.com/Gamddalki/VividNightmare",
    "content": [
      {
        "type": "image",
        "value": "/img/projects/VividNightmare.png"
      },
      {
        "type": "text",
        "value": "Level 1 ☃️ Find the key and open the door to go out. Beware of candy canes!"
      },
      {
        "type": "text",
        "value": "Level 2 🌵 Find one real key out of three keys and open the door to go out. Beware of rocks! (*The real key is randomly changed every time)"
      },
      {
        "type": "text",
        "value": "Level 3 ♟️ Find one real key out of six keys and open the door to go out. Beware of chess pieces and teddy bears dropping down from above! (*The real key is randomly changed every time)"
      },
      {
        "type": "text",
        "value": "Game Clear ⏰ Congratulations! You're awake!"
      }
    ]
  },
  {
    "id": 9,
    "title": "Jeogiyo",
    "subtitle": "VUI Application for Assisting Contactless Ordering Services in Stores",
    "where": "2023 Human Computer Interaction Project",
    "thumbnail": "/img/projects/Jeogiyo.png",
    "techStack": ["Figma"],
    "myRole": ["Designer", "Developer"],
    "startDate": "2023-09",
    "endDate": "2023-12",
    "summary": "Virtual Assistant Application that helps middle-aged and older adults to easily use contactless ordering services at stores by VUI (Voice User Interface).",
    "link": "https://gamddalki.tistory.com",
    "content": [
      {
        "type": "text",
        "value": "'Jeogiyo' is a personal virtual assistant application designed to help middle-aged and older adults use contactless services with ease. We made a goal to eliminate barriers in digital interactions by improving accessibility and simplifying complex user interfaces."
      },
      {
        "type": "image",
        "value": "/img/projects/Jeogiyo1.png"
      },
      {
        "type": "text",
        "value": "To validate the need for our service, we conducted a survey, which revealed that individuals over the age of 40 find current contactless systems (e.g. kiosk) difficult to use due to complex operations, poor readability, and insufficient guidance."
      },
      {
        "type": "image",
        "value": "/img/projects/Jeogiyo.png"
      },

      {
        "type": "text",
        "value": "To address these challenges, we developed 'Jeogiyo', a virtual assistant application that enhances the user experience through conversational interactions. 'Jeogiyo' activates through voice commands and provides real-time responses, ensuring seamless transactions with minimal effort. The system supports multiple interface types, including voice interaction and typing, for greater accessibility."
      },
      {
        "type": "image",
        "value": "/img/projects/Jeogiyo2.png"
      },
      {
        "type": "text",
        "value": "Key functional and non-functional requirements were determined to ensure effortless use with minimal device operation."
      }
    ]
  }
]
