[
  {
    "id": "prompirit",
    "title": "Prompirit",
    "subtitle": "Automatic Prompt Engineering Assistance for Improving AI-Generated Art Reflecting User Emotion",
    "where": "IEEE International Conference on Information Reuse and Integration (IRI)",
    "thumbnail": "/img/publications/Prompirit_t.png",
    "bignail": "/img/publications/Prompirit1.png",
    "date": "07-09 August 2024",
    "type": ["Conference Paper", "AI", "User Research"],
    "indexTerms": [
      "Prompt Engineering",
      "Text-to-Image GenAI",
      "Emotional and Art Technology"
    ],
    "myRole": [
      "Team Lead",
      "Pipeline Development (Text Emotion Recognition)",
      "Experiment Design (Emotion Labels)",
      "Data Analysis (LMER)"
    ],
    "tools": ["Python", "PyTorch", "Hugging Face"],
    "authors": ["Hannah Kim", "Hyun Lee", "Sunyu Pang", "Uran Oh*"],
    "abstract": [
      {
        "type": "text",
        "value": "Recently, text-to-image generative Artificial Intelligence (AI) models have demonstrated their ability to generate high-quality art with text prompts. However, generative AI is still incapable of creating images that precisely reflect emotion. We propose Prompirit, an automatic prompt engineering assistance for improving AI-generated art in terms of expressiveness of emotion and aesthetics. We explored various approaches to refine users’ free-form text input by incorporating user emotion and style modifiers. Statistical analysis and user evaluation with 100 respondents showed that Prompirit significantly improved the alignment of image-emotion and the aesthetics of the generated image while precisely conveying the content of the original input text. Based on the results, we provide implications for creating affective images."
      },
      {
        "type": "image",
        "value": "/img/publications/Prompirit2.jpg"
      }
    ],
    "contributions": [
      "Proposed an automatic prompt engineering assistance that enhances AI-generated images with an emphasis on emotion and the matching style.",
      "Empirically evaluated Prompirit in comparisons to other prompt engineering methods in terms of both objective and subjective metrics."
    ],
    "video": "https://www.youtube.com/embed/fpPVkb83wpY",
    "links": [
      {
        "type": "fullpaper",
        "value": "https://ieeexplore.ieee.org/document/10703854"
      },
      {
        "type": "github",
        "value": "https://github.com/AnT-Prompirit"
      }
    ],
    "selected": true,
    "pinned": true
  }
]
